13/data/attachments/858e993df2fc82a4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bea1e51b-ccf9-435f-83f3-d38a4b0a24db</nif:username>
            <nif:friendToBeAdded>Amanda_few_Friend_21004_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>